number = int(input('Введите числло искомого месяца: '))
if 1 < number <=12:
    months = ['Январь', 'Февраль', 'Март', 'Апрель', 'Май', 'Июнь', 'Июль', 'Август',
              'Сентябрь', 'Октябрь', 'Ноябрь', 'Декабрь']

    print(months[number-1], '- through the list')

    dictmonth = {1:'Январь', 2:'Февраль', 3:'Март', 4:'Апрель', 5:'Май', 6:'Июнь', 7:'Июль', 8:'Август',
                 9:'Сентябрь', 10:'Октябрь', 11:'Ноябрь', 12:'Декабрь'}

    print(dictmonth[number], ' - through the dictionary')

else:
    print('Ошбика! Введите число между 1-12')